# HasInsulation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..HasInsulation Property
FabricationPart Class See Also
---
True if the fabrication part is insulated.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool HasInsulation { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HasInsulation As Boolean
	Get
```

Visual C++
---
```text
public:
property bool HasInsulation {
	bool get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace